
# ML ASSIGNMENT 2


#### Name : Naveen Vamshi
#### RollNo : 160117733101

In [219]:
import numpy as np
import pandas as pd
students = [('Naveen', 100, 'Hyderabad',99),
            ('Vamshi', 101, 'Hyderabad', 90),
            ('Anudeep', 86, 'Warangal', 80),
            ('Nihal', 115, 'Hyderabad', 70),
            ('Harsha', 320, 'Khammam', 60.5),
            ('Sankeerth', 110, 'Hyderabad', 60),
            ('Varun', 91, 'Vijaywada', 50)
           ]

In [3]:
df = pd.DataFrame(students,columns= ['Name','Roll','City','Marks'])
print(df)

        Name  Roll       City  Marks
0     Naveen   100  Hyderabad   99.0
1     Vamshi   101  Hyderabad   90.0
2    Anudeep    86   Warangal   80.0
3      Nihal   115  Hyderabad   70.0
4     Harsha   320    Khammam   60.5
5  Sankeerth   110  Hyderabad   60.0
6      Varun    91  Vijaywada   50.0

In [4]:
#nrows #ncols
print(df.shape)
print("#nrow,ncol")

(7, 4)
#nrow,ncol

In [5]:
print("#DataTypes")
print(df.dtypes)

#DataTypes
Name      object
Roll       int64
City      object
Marks    float64
dtype: object

In [6]:
print(df.dtypes.value_counts())

object     2
int64      1
float64    1
dtype: int64

In [7]:
print("describe function\n"+str(df.describe))

describe function
<bound method NDFrame.describe of         Name  Roll       City  Marks
0     Naveen   100  Hyderabad   99.0
1     Vamshi   101  Hyderabad   90.0
2    Anudeep    86   Warangal   80.0
3      Nihal   115  Hyderabad   70.0
4     Harsha   320    Khammam   60.5
5  Sankeerth   110  Hyderabad   60.0
6      Varun    91  Vijaywada   50.0>

In [8]:
print("#array\n"+str(df.to_numpy()))

#array
[['Naveen' 100 'Hyderabad' 99.0]
 ['Vamshi' 101 'Hyderabad' 90.0]
 ['Anudeep' 86 'Warangal' 80.0]
 ['Nihal' 115 'Hyderabad' 70.0]
 ['Harsha' 320 'Khammam' 60.5]
 ['Sankeerth' 110 'Hyderabad' 60.0]
 ['Varun' 91 'Vijaywada' 50.0]]

In [10]:
print("#list\n"+str(df.values.tolist()))

#list
[['Naveen', 100, 'Hyderabad', 99.0], ['Vamshi', 101, 'Hyderabad', 90.0], ['Anudeep', 86, 'Warangal', 80.0], ['Nihal', 115, 'Hyderabad', 70.0], ['Harsha', 320, 'Khammam', 60.5], ['Sankeerth', 110, 'Hyderabad', 60.0], ['Varun', 91, 'Vijaywada', 50.0]]

In [11]:
#2.Extract the row and column number of a particular cell with given criterion?Rename a specific columns in a dataframe?

In [13]:
df.loc[df["Roll"]==101]

     Name  Roll       City  Marks
1  Vamshi   101  Hyderabad   90.0

In [22]:
#extracting row,col number of roll num 101
r,c = np.where(df.values==101)
print("row,col")
print(r,c)

row,col
[1] [1]

In [101]:
#renaming
print(df.rename(columns={"City":"Place"}))

        Name Roll      Place Marks
0     Naveen  100  Hyderabad    99
1     Vamshi  101  Hyderabad    90
2    Anudeep   86   Warangal    80
3      Nihal  115  Hyderabad    70
4     Harsha  320    Khammam  60.5
5  Sankeerth  110  Hyderabad    60
6      Varun   91  Vijaywada    50
7    Vaibhaw  NaN  Hyderabad   NaN
8      Surya  NaN        NaN    78

In [98]:
 #3.Count the number of missing values in each column?

In [99]:
#creating another data frame which consists null values
df2 = pd.DataFrame({"Name":["Vaibhaw","Surya"],
                    "Roll":[np.nan,np.nan],
                    "City":["Hyderabad",np.nan],
                    "Marks":[np.nan,78]
                   })
print(df2)

      Name  Roll       City  Marks
0  Vaibhaw   NaN  Hyderabad    NaN
1    Surya   NaN        NaN   78.0

In [ ]:
df.append(df2)

In [90]:
df = df.append(df2,ignore_index=True)

In [91]:
print(df)

        Name Roll       City Marks
0     Naveen  100  Hyderabad    99
1     Vamshi  101  Hyderabad    90
2    Anudeep   86   Warangal    80
3      Nihal  115  Hyderabad    70
4     Harsha  320    Khammam  60.5
5  Sankeerth  110  Hyderabad    60
6      Varun   91  Vijaywada    50
7    Vaibhaw  NaN  Hyderabad   NaN
8      Surya  NaN        NaN    78

In [95]:
 #printing count of null
print(df.isnull().sum())

Name     0
Roll     2
City     1
Marks    1
dtype: int64

In [ ]:
#--------------------------------------

In [ ]:
#4.Replace missing values of multiple numeric columns with the mean?

In [116]:
 #replacing strings with highest repeated city
df["City"].fillna(df["City"].mode()[0])
#median for numeric values
df["Roll"].fillna(3)
df["Roll"].fillna(df["Roll"].median())

df["Marks"].fillna(df["Marks"].median(),inplace=True)

print(df)
#the values will be replaced only when inplace will be true (for example marks)

        Name Roll       City  Marks
0     Naveen  100  Hyderabad   99.0
1     Vamshi  101  Hyderabad   90.0
2    Anudeep   86   Warangal   80.0
3      Nihal  115  Hyderabad   70.0
4     Harsha  320    Khammam   60.5
5  Sankeerth  110  Hyderabad   60.0
6      Varun   91  Vijaywada   50.0
7    Vaibhaw  NaN  Hyderabad   74.0
8      Surya  NaN        NaN   78.0

In [117]:
#5. Apply function on existing columns with global variables as additional arguments?

In [118]:
f = pd.DataFrame([[1,2],[3,4]]) 
print(f)
def add(num):
    return num+1 
new = f.apply(add)

print("After applying the dataframe is:")
print(new)

   0  1
0  1  2
1  3  4
After applying the dataframe is:
   0  1
0  2  3
1  4  5

In [119]:
#6. Change the order of columns of a data frame?

In [124]:
df = df[["Roll","Name","Marks","City"]]
print(df.columns)

Index(['Roll', 'Name', 'Marks', 'City'], dtype='object')

In [125]:
#7. .Set the number of rows and columns displayed in the output

In [127]:
#rows
print(df.head(3))

  Roll     Name  Marks       City
0  100   Naveen   99.0  Hyderabad
1  101   Vamshi   90.0  Hyderabad
2   86  Anudeep   80.0   Warangal

In [133]:
#cols
print(df[df.columns[1:3]])

        Name  Marks
0     Naveen   99.0
1     Vamshi   90.0
2    Anudeep   80.0
3      Nihal   70.0
4     Harsha   60.5
5  Sankeerth   60.0
6      Varun   50.0
7    Vaibhaw   74.0
8      Surya   78.0

In [134]:
#8. Create a primary key index by combining relevant columns?

In [144]:
df["newidx"] = str(df["Roll"])+df["Name"]
df.set_index("newidx",inplace=True)
print(df)

                                                   Roll       Name  Marks  \
newidx
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  100     Naveen   99.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  101     Vamshi   90.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...   86    Anudeep   80.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  115      Nihal   70.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  320     Harsha   60.5
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  110  Sankeerth   60.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...   91      Varun   50.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  NaN    Vaibhaw   74.0
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  NaN      Surya   78.0

                                                         City
newidx
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Hyderabad
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Hyderabad
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...   Warangal
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Hyderabad
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...    Khammam
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Hyderabad
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Vijaywada
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...  Hyderabad
newidx\nnewidx\nnewidx\nnewidx\n0    100\n1    ...        NaN

In [145]:
#9. Get the row number of the nth largest value in a column?

In [149]:
df.Marks.nlargest(3).iloc[-1]

80.0

In [158]:
 #10.Findthepositionofthenthlargestvaluegreaterthanagivenvalue

In [160]:
df_to_array = df["Marks"].to_numpy() 
ser = pd.Series(df_to_array)
ser[ser > ser.mean()].index[1]

1

In [161]:
#11. Get the last n rows of a dataframe with row sum > 100?

In [162]:
ndf = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4)) 
df1 = ndf.copy(deep = True)
rowsums = df1.apply(np.sum, axis=1)# last two rows with row sum greater than 100
last_two_rows = df1.iloc[np.where(rowsums > 100)[0][-2:], :] 
last_two_rows

     0   1   2   3
10  25  24  39  35
14  37  31  21  39

In [163]:
#12. Create a column containing the minimum by maximum of each row?

In [164]:
ndf["min_by_max"] = (ndf.apply(min, axis = 1)/ndf.apply(max, axis = 1))
ndf

     0   1   2   3  min_by_max
0   31  17  13  14    0.419355
1   33  32  38  17    0.447368
2   30  24  13  30    0.433333
3   38  25  23  37    0.605263
4   33  20  11  39    0.282051
5   19  11  35  28    0.314286
6   17  31  37  18    0.459459
7   28  31  22  30    0.709677
8   27  29  20  13    0.448276
9   34  22  32  23    0.647059
10  25  24  39  35    0.615385
11  20  11  24  29    0.379310
12  16  18  32  23    0.500000
13  11  35  27  11    0.314286
14  37  31  21  39    0.538462

In [166]:
#13. Create a column that contains the penultimate value in each row?

In [167]:
out = ndf.apply(lambda x: x.sort_values().unique()[-2], axis=1) 
ndf['penultimate'] = out
ndf

     0   1   2   3  min_by_max  penultimate
0   31  17  13  14    0.419355         17.0
1   33  32  38  17    0.447368         33.0
2   30  24  13  30    0.433333         24.0
3   38  25  23  37    0.605263         37.0
4   33  20  11  39    0.282051         33.0
5   19  11  35  28    0.314286         28.0
6   17  31  37  18    0.459459         31.0
7   28  31  22  30    0.709677         30.0
8   27  29  20  13    0.448276         27.0
9   34  22  32  23    0.647059         32.0
10  25  24  39  35    0.615385         35.0
11  20  11  24  29    0.379310         24.0
12  16  18  32  23    0.500000         23.0
13  11  35  27  11    0.314286         27.0
14  37  31  21  39    0.538462         37.0

In [168]:
#14. Normalize all columns in adataframe?

In [170]:
#First normalization: mean and std
df1 = ndf.apply(lambda x: ((x-np.mean(x))/np.std(x)), axis = 0) 
print(df1)
# min max
df2 = ndf.apply(lambda x: ((x.max() -x)/(x.max() -x.min())).round(2)) 
print(df2)

           0         1         2         3  min_by_max  penultimate
0   0.550115 -0.967079 -1.407585 -1.267730   -0.442651    -2.231375
1   0.800167  1.085683  1.341605 -0.943594   -0.216712     0.695019
2   0.425089 -0.009123 -1.407585  0.460993   -0.329910    -0.951078
3   1.425297  0.127727 -0.307909  1.217309    1.056761     1.426617
4   0.800167 -0.556527 -1.627520  1.433399   -1.550050     0.695019
5  -0.950198 -1.788184  1.011702  0.244902   -1.290069    -0.219480
6  -1.200250  0.948832  1.231637 -0.835549   -0.119194     0.329219
7   0.175036  0.948832 -0.417877  0.460993    1.898897     0.146320
8   0.050010  0.675131 -0.637812 -1.375775   -0.209394    -0.402379
9   0.925193 -0.282825  0.681799 -0.295323    1.393857     0.512119
10 -0.200042 -0.009123  1.451572  1.001219    1.138394     1.060818
11 -0.825172 -1.788184 -0.197942  0.352948   -0.765623    -0.951078
12 -1.325276 -0.830228  0.681799 -0.295323    0.207779    -1.133978
13 -1.950406  1.496236  0.131961 -1.591865   -1.290069    -0.402379
14  1.300271  0.948832 -0.527844  1.433399    0.517984     1.426617
       0     1     2     3  min_by_max  penultimate
0   0.26  0.75  0.93  0.89        0.68         1.00
1   0.19  0.12  0.04  0.79        0.61         0.20
2   0.30  0.46  0.93  0.32        0.65         0.65
3   0.00  0.42  0.57  0.07        0.24         0.00
4   0.19  0.62  1.00  0.00        1.00         0.20
5   0.70  1.00  0.14  0.39        0.92         0.45
6   0.78  0.17  0.07  0.75        0.59         0.30
7   0.37  0.17  0.61  0.32        0.00         0.35
8   0.41  0.25  0.68  0.93        0.61         0.50
9   0.15  0.54  0.25  0.57        0.15         0.25
10  0.48  0.46  0.00  0.14        0.22         0.10
11  0.67  1.00  0.54  0.36        0.77         0.65
12  0.81  0.71  0.25  0.57        0.49         0.70
13  1.00  0.00  0.43  1.00        0.92         0.50
14  0.04  0.17  0.64  0.00        0.40         0.00

In [171]:
#________________________________________________________________________________________________________________

In [190]:
### 1. Create Dataset or using Standard Data Sets perform following
#Preprocessing
#Identify Null Values print them
#Handling missing values with Imputer Classand Without Imputer what are the different methods or Strategies 
#Handling Categorical
#Perform Encoding with Methods

In [181]:
import numpy as np 
import pandas as pd

dataset = pd.read_csv("csvfiles/fortune500.csv",encoding='latin-1')
dataset.head()

   rank             company  revenue ($ millions)  profit ($ millions)
0     1             Walmart                485873              13643.0
1     2  Berkshire Hathaway                223604              24074.0
2     3               Apple                215639              45687.0
3     4         Exxon Mobil                205004               7840.0
4     5            McKesson                192487               2258.0

In [182]:
dataset.isnull().values.any()

True

In [183]:
print(dataset.columns)

Index(['rank', 'company', 'revenue ($ millions)', 'profit ($ millions)'], dtype='object')

In [184]:
dataset.isnull().sum()

rank                    0
company                 0
revenue ($ millions)    0
profit ($ millions)     1
dtype: int64

In [191]:
#fillling missing values
dataset['profit ($ millions)'].fillna(dataset['profit ($ millions)'].mean(),inplace=True)
print(dataset)

     rank             company  revenue ($ millions)  profit ($ millions)
0       1             Walmart                485873         13643.000000
1       2  Berkshire Hathaway                223604         24074.000000
2       3               Apple                215639         45687.000000
3       4         Exxon Mobil                205004          7840.000000
4       5            McKesson                192487          2258.000000
..    ...                 ...                   ...                  ...
495   496       Michaels Cos.                  5197           378.200000
496   497       Toll Brothers                  5170           382.100000
497   498               Yahoo                  5169          -214.300000
498   499       Vistra Energy                  5164          1783.475351
499   500      ABM Industries                  5145            57.200000

[500 rows x 4 columns]

In [192]:
#imputer

In [193]:
#handling catergorical

In [208]:

#creating dependant matrix
dd = dataset.iloc[:, :-1].values
print(dd)

[[1 'Walmart' 485873]
 [2 'Berkshire Hathaway' 223604]
 [3 'Apple' 215639]
 ...
 [498 'Yahoo' 5169]
 [499 'Vistra Energy' 5164]
 [500 'ABM Industries' 5145]]

In [211]:
#encoding

#sklearn

from sklearn.preprocessing import LabelEncoder 
labelencoder_X = LabelEncoder()
X = dataset.iloc[:, :-1].values
y = dataset.iloc[:, -1].values
X[:,0] = labelencoder_X.fit_transform(X[:,0]) 
X[:,1] = labelencoder_X.fit_transform(X[:,1])
X

array([[0, 474, 485873],
       [1, 72, 223604],
       [2, 46, 215639],
       ...,
       [497, 493, 5169],
       [498, 467, 5164],
       [499, 2, 5145]], dtype=object)

In [212]:
print(X[:,1])

[474 72 46 178 300 457 94 202 9 192 38 29 200 464 100 131 473 264 112 180
 249 177 229 78 477 67 26 305 44 116 122 236 414 366 253 371 462 427 194
 286 144 302 15 361 49 448 242 373 20 456 291 151 233 364 7 284 423 182
 226 115 215 156 213 119 324 105 31 320 301 113 145 74 230 102 279 310 296
 208 167 424 342 445 452 24 375 33 425 329 174 199 391 206 90 0 437 109
 333 179 442 98 444 450 488 365 142 263 428 62 308 289 10 299 158 332 126
 384 42 51 377 372 159 169 39 449 446 16 401 152 57 123 413 165 244 429 11
 153 484 407 166 412 367 360 451 139 406 290 82 27 190 262 272 250 222 435
 259 307 349 419 133 107 4 492 293 354 201 350 32 238 334 328 362 348 217
 99 195 485 68 198 340 204 137 121 351 209 421 135 466 330 237 478 490 48
 87 5 476 188 125 422 88 434 475 239 337 309 120 433 281 325 270 294 163
 85 285 86 260 256 480 212 395 265 247 181 390 465 70 304 370 50 317 461
 146 134 71 127 164 403 316 154 37 3 227 187 223 439 64 387 129 76 271 411
 357 417 172 104 77 491 93 460 251 274 211 275 168 359 47 468 297 369 277
 58 415 136 266 228 368 459 149 336 455 402 69 470 59 331 65 25 405 344
 235 268 313 14 183 17 231 225 288 130 389 21 184 355 418 267 80 66 92 374
 162 497 306 341 196 323 34 436 175 282 61 388 197 430 347 363 453 499 81
 326 205 283 463 327 132 207 353 276 321 458 97 147 483 314 111 41 245 248
 416 191 481 408 141 496 376 469 378 161 108 173 43 160 55 106 221 214 352
 379 486 471 224 6 382 295 472 280 319 261 311 23 124 234 273 170 432 54
 140 220 335 381 185 380 255 155 409 396 1 440 400 56 495 96 346 426 252
 254 193 12 246 128 315 53 35 150 73 398 95 157 148 216 91 210 83 494 101
 40 343 498 443 22 176 60 30 218 312 410 219 386 243 19 338 269 8 393 13
 63 431 318 138 385 36 356 117 454 118 203 287 240 447 345 397 292 489 52
 84 186 420 358 339 322 383 441 189 232 241 298 28 114 404 482 258 143 79
 110 479 103 487 399 171 45 18 257 278 394 392 89 75 303 438 493 467 2]

In [213]:
en=LabelEncoder()

In [216]:
X[:, 0] = en.fit_transform(X[:, 0])

In [218]:
X

array([[0, 474, 485873],
       [1, 72, 223604],
       [2, 46, 215639],
       ...,
       [497, 493, 5169],
       [498, 467, 5164],
       [499, 2, 5145]], dtype=object)